{
'NamePat':"Гутнова А.К",
'Date':"№ 12 от «26» июня 2020 г.",
'Koi':"В.А.Койбаев",
'DisciplineTarget':"Дисциплина «Web-программирование» призвана содействовать знакомству студентов с компьютерными телекоммуникациями и возможными подходами к разработке гипертекстовых документов, предназначенных для публикации в глобальной компьютерной сети Internet. Она важна с той точки зрения, что позволяет развивать способности студентов, связанные с общей культурой работы в глобальной сети. Курс позволяет овладеть технологиями проектирования структуры web-сайта как информационной системы, создания web-сайта средствами программирования на стороне клиента и сервера, а также размещения, поддержки и сопровождения web-сайта на сервере.",
'OPOP':"школьного курса «Информатика», а также в результате освоения дисциплин: «Компьютерные науки (Языки программирования)», «Компьютерные науки (Информатика)».**О понимании проблематики, целей и задач программирования, знании современных технологий программирования (структурное, модульное программирование), а также знании методов отладки и тестирования программ.",
'Know':"-основы функционирования World Wide Web;-язык гипертекстовой разметки HTML;-технологию разделения содержимого и оформления с использованием каскадных таблиц стилей CSS;-основные технологии создания Web-сайтов;-протоколы обмена информацией Web-серверов и клиентских браузеров;-основы конфигурирования web-сервера Apache для работы с РНР, SSI;-способы эффективной реализации Web-интерфейсов к базам данных;-подходы к технологиям программирования и web-технологиям;-современные тенденции развития телекоммуникационных технологий;-основы математического и алгоритмического моделирования;-подходы к переносу полученных знаний по программированию на другие задачи и другие средства разработки;-как конструкции языков веб-программирования отражают разнообразные виды действий и объектов, встречающиеся при решении практических задач по работе с данными в сети Интернет;",
'BeAbleTo':"-разворачивать рабочую среду web-разработки: выполнять разработку (написание и отладка кода) скриптов на языке РНР;-применять с использованием справочных материалов библиотечные функции РНР; -реализовывать простейшую функциональность клиентской стороны с помощью языка JavaScript; -самостоятельно создавать web-приложения уровня интернет-сайта с использованием языка РНР;-программировать алгоритмы решения задач из области программирования для Интернета;-отлаживать программы для работы в сети Интернет;-пользоваться справочными материалами в отношении РНР, HTML, JavaScript, CSS;-создавать и публиковать в Интернете собственные сайты;-реализовать основные алгоритмические конструкции посредством языка РНР; -переносить созданное web-приложение на реальный web-сервер; -инсталлировать и администрировать серверное и клиентское программное обеспечение для создания web-интерфейсов к базам данных;",
'Own':"-навыками работы в различных программных средах;-общей методикой проектирования web-сайта;-навыками организации коллективной работы над телекоммуникационными проектами;-методами и средствами создания сайтов;-методами системного анализа и математического моделирования для анализа социально-экономических задач и процессов;",
'ControlTasks':"1.Разработать дизайн сайта интернет-магазина и написать для него код на HTML с использованием CSS;*2.Интерактивное меню навигации CSS;*3.Написать регулярные выражения на JavaScript для проверки email;*4.Создайте и заполните ассоциированный массив, в котором именами элементов будет название страны, население и название столицы (английские названия придумайте самостоятельно). Выведите из массива таблицу в три строки по две ячейки в каждой. В левой ячейке - имя элемента, в правой - его значение.*5.Подсчитать количество хитов/хостов;*6.Требуется написать гостевую книгу на текстовой базе;*7.Разработать MySQL БД интернет-магазина, и переписать скрипт регистрации.;*8.Поисковая система. Система голосования;*9.Постраничный вывод данных на PHP и MySQL;*10.Создание плагина Excerpt для CMS WordPress с настройкой параметров в административном интерфейсе.",
'TestTasks':"Примеры тестовых заданий по дисциплине:*1. Укажите тег позволяющий определить поле для ввода пароля. +<input type='password' /><pass><hide><password>*2. Как определить в классе метод myMethod?определить функцию function myMethod() и вставить ее в класс с помощью слова new+определить в классе функцию function myMethod()определить в классе функцию method myMethod()в классе не может быть методов*3. Текстовые строки в PHP заключаются вквадратные скобки+кавычкикруглые скобки и кавычкикруглые скобки*4. Для чтения из файла используется функцияfwrite(указатель файла, данные)+file(имя файла)fopen(имя файла, режим)",
'QuestionForTest':"1. Глобальные компьютерные сети: основные понятия, принципы функционирования.*2. Каталоги ресурсов. Поисковые системы.*3. Язык гипертекстовой разметки страниц HTML*4. Общие подходы к дизайну сайта. Разработка макета страницы*5. Использование стиля при оформлении сайта. Возможности CSS*6. Хостинг. Бесплатный хостинг. FTP. Размещение Интернет-ресурса на сервере провайдера*7. Регистрация Интернет-ресурса в каталогах и поисковых системах*8. Преимущества и ограничения программ, работающих на стороне клиента*9. Язык JavaScript*10. Библиотека jQuery. Обращение к элементам.*11. Основы клиент-серверных технологий.*12. Введение в программирование на стороне сервера на примере PHP. Принцип работы*13. HTML-формы и отправка данных с ее помощью.*14. Краткая характеристика методов Post и Get. Механизм получения данных из HTML-форм, и их обработка с помощью PHP.*15. Cookie. Клиентские сценарии и приложения. Программы, выполняющиеся на клиент-машине. Программы, выполняющиеся на сервере.*16. Программирование взаимодействия PHP и MySQL. Структурированный язык запросов SQL. Команды языка SQL.*17. Системы управление контентом (CMS). Назначение, функции.*18. Классификация CMS.*19. Настройка WordPress. Плагины, шаблоны. ",
'InformationSupportOfDiscipline':"1.Балашов Л.Е.Философия:учебник.–4-е изд.,испр.идоп.–М.:ДашковиК°,2017.–612 с. – Режим доступа: по подписке. – URL:*2.Канке В.А. Основы философии: учебник / В.А. Канке. – М.: Логос, 2012. – 288 с. – Режим доступа: по подписке. – URL:*ресурсы в СВОБОДНОМ ДОСТУПЕ",
'LogisticsOfTheDiscipline':"4.1C:Предприятие.Бухгалтерский Учет. Типовая конфигурация 8 сетевая версия (№ СД/108 от 29.08.2017 (максимум-софт) бессрочно);.*5.CiscoWebex- Система проведения вебинаров (ООО Айстекдоговор № Д83-2020 от 10.08.2020-10.08.2021 г.).*6.Система управления базами данных MySQL FireBird;*7.VisualStudioCode;*8.Blend for Visual Studio;*9.Visual Studio 2019;*10.Open Server;*11.Code Blocks;*12.Anaconda3;*13.Android Studio;*14.PyCharm-community;*15.Python 3.8.5;*16.Sublime text 3;*17.Cisco Packet Tracer",
'UpdateSheet':"№ 12 от «26» июня 2020 г.",
'EducTechn':[
'1 *Язык PHP*Практическое *5 *Интерактивная лекция *Разработка проекта «Социальная сеть»"',
'2 *СУБД MySQL *Практическое *7 *Традиционные лекции и практические (семинарские) занятия *Разработка проекта «Интернет магазин» ',
'3 *Проектирование БД *Практическое *5 *Разработка проекта *Разработка проекта «Форум»',
'4 *CMS *Практическое *7 *Творческое задание *Разработка проекта «CMS»'],
'DiscMap':[
'1. *Глобальные компьютерные сети Основные понятия, принципы функционирования. Каталоги ресурсов. Поисковые системы. *1 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *2 *[1-8]',
'2. *Язык гипертекстовой разметки страниц HTML Общая структура документа, абзацы, цвета, ссылки. Графические форматы, графический объект как ссылка. Таблицы. Фреймы. Общие подходы к дизайну сайта. Разработка макета страницы. Формы. *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *5* ',
'3. *Каскадные стили страниц CSS Свойства текста. Свойства цвета и фона. Свойства шрифта. Свойства блоков. Свойства списков. Классы. Псевдоклассы. *2 *Восстановление CSS файла по готовой структуре HTML документа *2 *Устный опрос, сообщения по вопросам темы, конспект. *0 *8* ',
'4. *Динамический язык стилей SASS/SCSS *1 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *2* ',
'5. *Язык JavaScript Преимущества и ограничения программ, работающих на стороне клиента. Язык JavaScript: основы синтаксиса. Объектная модель HTML страницы. Регулярные выражения *2 * * *Устный опрос, сообщения по вопросам темы, *0 *7* ',
'6. *Библиотека JQuery, Bootstrap *2 *Создание Landing Page с использованием библиотеки Bootstrap *4 *Устный опрос, сообщения по вопросам темы, конспект. *0 *10* ',
'7. *Регулярные выражения на JavaScript Регулярные выражение, реализация механизма регулярных выражений на языке JavaScript. Объектная модель XML-документа *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *10* ',
'8. *Плагины всплывающих подсказок *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *5* ',
'9. *Локальный сервер Apache *2 *Настройка сервера, конфигурационный файл, файл htaccess *2 Устный опрос, сообщения по вопросам темы, конспект. *0 *6* ',
'10. *Язык PHP, методы передачи параметров между страницами Введение в программирование на стороне сервера на примере PHP. Принцип работы. Синтаксис языка программирования PHP. Переменные. Константы. Операторы в PHP. Циклы. Массивы. Работа со строками. Функции в PHP. Встроенные функции. Работа с датой и временем в PHP. Связь PHP и HTML. Методы передачи параметров между страницами (GET, POST). Обработка действий пользователя при помощи форм. Использование вспомогательных переменных. *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *4*',
'11. *Парсеры *2 *Создание собственного парсера *4 *Устный опрос, сообщения по вопросам темы, конспект. *0 *7* ',
'12. *Язык запросов SQL. Базы данных в MySQL Синтаксис запросов к базе данных. Механизм работы с базами данных — PhpMyAdmin. Решение задач (сортировка, вывод с условиями и т.д.). Управление форматами даты и времени. Функция DATE_FORMAT. Варианты хранения информации в сети Internet. Принципы хранения информации в базах данных MySQL. Архитектура базы данных MySQL (таблицы, связи, триггеры). Проектирование баз данных. Нормализация таблиц. *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *8* ',
'13. *Сессии и cookie Авторизация доступа с помощью сессий. Инициализация сессий, передача идентификатора пользователя, регистрация переменных сессии, уничтожение сессии. темы, конспект. *2 * * *Устный опрос, сообщения по вопросам *0 *4* ',
'14. *Шаблонизаторы Виды шаблонизаторов *2 *Шаблонизатор Smarty *6 *Устный опрос, сообщения по вопросам темы, конспект. *0 *6* ',
'15. *Технология AJAX Встроенный объект XMLHttpRequest *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *4* ',
'16. *Content management system (CMS) с открытым исходным кодом *2 * * *Устный опрос, сообщения по вопросам темы, конспект. *0 *5* ',
'17. *Создание плагинов, виджетов и тем для CMS WordPress *2 *Хуки: actions, filers, short_codes *4 *Устный опрос, сообщения по вопросам темы, конспект. *0 *5* ',
'18. *Создание собственного API *2 * * * *0 *2* ']
}