{
	'ResultMark':[
	{
		'FormsControl':"Посещение занятий (max 8 б.)", 
		'CurrentControl':"1. Текущий контроль (max 25 баллов за 1 модуль) ",
        'First':"7-8 баллов*Студент посетил более 85% занятий", 
        'Second':"6–7 баллов*Студент посетил 71–85% занятий", 
		'Third':"4–5 баллов*Студент посетил 56–70% занятий",
        'Fourth':"0–3 баллов*Студент посетил менее 56% занятий"
	},
	{
		'FormsControl':"Текущая работа в течение модуля (мах 10б.)", 
		'CurrentControl':"1. Текущий контроль (max 25 баллов за 1 модуль) ",
        'First':"9–10 баллов*Студент активно работает на занятиях, превосходно выполняет все задания преподавателя.", 
        'Second':"7–8 баллов*Студент активно работает на занятиях, хорошо выполняет задания преподавателя.", 
		'Third':"6–7 баллов*Студент недостаточно активно работает на занятиях, удовлетворительно выполняет задания преподавателя.",
        'Fourth':"0–5 баллов*Студент недостаточно активно работает на занятиях, неудовлетворительно выполняет задания преподавателя."
	},
	{
		'FormsControl':"Доклад, презентация (мах 3б.) / опорный конспект (max 2б.)", 
		'CurrentControl':"1. Текущий контроль (max 25 баллов за 1 модуль) ",
        'First':"3/2 балла*Тема полностью раскрыта. Превосходное владение материалом. Высокий уровень самостоятельности, логичности, аргументированности. Превосходный стиль изложения.", 
        'Second':"2 балла*Тема в основном раскрыта. Хорошее владение материалом. Средний уровень самостоятельности, логичности, аргументированности. Хороший стиль изложения.", 
		'Third':"1 балл*Тема частично раскрыта. Удовлетворительное владение материалом. Низкий уровень самостоятельности, логичности, аргументированности. Удовлетворительный стиль изложения.",
        'Fourth':"0 баллов*Тема не раскрыта. Неудовлетворительное владение материалом. Недостаточный уровень самостоятельности, логичности, аргументированности. Неудовлетворительный стиль изложения."
	},
	{
		'FormsControl':"Контрольная работа", 
		'CurrentControl':"2. Рубежный контроль (25б. за 1 модуль)",
        'First':"22–25 баллов*Правильно выполнены все задания. Продемонстрирован высокий уровень владения материалом. Проявлены превосходные способности применять знания и умения к выполнению конкретных заданий.", 
        'Second':"18–21 балл*Правильно выполнена большая часть заданий. Присутствуют незначительные ошибки. Продемонстрирован хороший уровень владения материалом. Проявлены средние способности применять знания и умения к выполнению конкретных заданий", 
		'Third':"14–17 баллов*Задания выполнены более чем наполовину. Присутствуют серьезные ошибки. Продемонстрирован удовлетворительный уровень владения материалом. Проявлены низкие способности применять знания и умения к выполнению конкретных заданий.",
        'Fourth':"0–13 баллов*Задания выполнены менее чем наполовину. Продемонстрирован неудовлетворительный уровень владения материалом. Проявлены недостаточные способности применять знания и умения к выполнению конкретных заданий."
	},
	{
		'FormsControl':"Экзамен/зачет", 
		'CurrentControl':"3. Итоговый контроль по дисциплине ",
        'First':"43–50 баллов*Дан полный,развернутый ответ на поставленный вопрос. Ответ формулируется в терминах науки, изложен литературным языком, логичен, доказателен, демонстрирует авторскую позицию студента.", 
        'Second':"36–42 балла*Дан полный ответ на поставленный вопрос, показано умение выделить существенные и несущественные признаки, причинно-следственные связи. Но допущены незначительные ошибки, исправленные студентом с помощью «наводящих» вопросов преподавателя.", 
		'Third':"28–35 баллов*Дан недостаточно полный ответ. Студент не способен самостоятельно выделить существенные и несущественные признаки и причинно-следственные связи. Речевое оформление требует поправок, коррекции.",
        'Fourth':"28–35 баллов*Не получены ответы по базовым вопросам дисциплины или дан неполный ответ и допущены грубые ошибки. Речь неграмотная. Уточняющие вопросы преподавателя не приводят к коррекции ответа студента не только на поставленный вопрос, но и на другие вопросы дисциплины."
	}
	]
	

}